Revit 2024 API
MEPAnalyticalSegment.Id Property
 The identity of this segment.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public int Id { get; }
Visual Basic
Public ReadOnly Property Id As Integer
	Get
Visual C++
public:
property int Id {
	int get ();
}
See Also
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace